choice = "y"
while choice.lower() == "y":
    try:
        a=float(input("Введіть довжину першого катета:"))
        b=float(input("Введіть довжину другого катета:"))
        S=0.5*a*b
        if a<=0 or b<=0 :
            print("Допустимі тільки додатні значення")
        else:
            print("Площа трикутника:", 0.5*a*b)
    except:
        print("Значення введено невірно")
    choice = input("Для продовження натисніть Y, а для виходу іншу клавішу: ")
print("Робота програми завершена")




