choice = "y"
while choice.lower() == "y":
    try:
        K=int(input("Введіть кількість кілограмів яблук:"))
        N=int(input("Введіть кількість студентів:"))
        if K<=0 or N<=0 :
            print("Допустимі тільки додатні значення")
        else:
            print("Кожен студент отримає:",K//N,"кг яблук")
            print("В кошику залишиться",K%N,"кг яблук")
    except:
        print("Значення введено невірно")
    choice = input("Для продовження натисніть Y, а для виходу іншу клавішу: ")
print("Робота програми завершена ")




